bench/results/h1-parse-sweep-20260427-051502/trillium-parse-recv16k.h2load.txt
starting benchmark...
spawning thread #0: 20 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 20 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 20 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 20 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #0.
Warm-up started for thread #1.
Warm-up started for thread #3.
Warm-up started for thread #2.
progress: 10% of clients started
progress: 20% of clients started
progress: 30% of clients started
progress: 40% of clients started
progress: 50% of clients started
progress: 60% of clients started
progress: 70% of clients started
progress: 80% of clients started
progress: 90% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
2.
Main benchmark duration is started for thread #2.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #3. Stopping all clients.
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Stopped all clients for thread #3

finished in 9.00s, 140404.50 req/s, 17.94MB/s
requests: 1123236 total, 1123236 started, 1123236 done, 1123236 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1123236 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 143.54MB (150513624) total, 117.71MB (123428060) headers (space savings 0.00%), 6.01MB (6297350) data
                     min         max         mean         sd        +/- sd
time for request:       38us      6.66ms       569us       285us    88.32%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :    1743.79     1767.03     1754.94        4.94    66.25%